// Задайте значения M и N. Напишите программу, которая 
// найдёт сумму натуральных элементов в промежутке от M до N. 
// Выполнить с помощью рекурсии.

// M = 1; N = 15 -> 120
// M = 4; N = 8. -> 30

Console.Write("Введите натуральное число M: ");
int numberM = Convert.ToInt32(Console.ReadLine());
Console.Write("Введите натуральное число N: ");
int numberN = Convert.ToInt32(Console.ReadLine());

int SumNumbers(int M, int N)
{
    if (M == 0) return (N * (N + 1)) / 2;            
    else if (N == 0) return (M * (M + 1)) / 2;       
    else if (M == N) return M;                       
    else if (M < N) return N + SumNumbers(M, N - 1); 
    return N + SumNumbers(M, N + 1);
}

if (numberM >= 0 && numberN >= 0)
{
    int result = SumNumbers(numberM, numberN);
    Console.WriteLine($"Сумма натуральных элементов в промежутке от {numberM} до {numberN} = {result}");
}
else Console.WriteLine($"Введите натуральные числа!");